export async function initConstitution() {
    document.addEventListener('click', e => {
        const btn = e.target.closest(".content-item");
        if (!btn) return;

        document.querySelectorAll(".content-item").forEach(el => {
            el.classList.remove("active");
        });
        btn.classList.add("active");

        const sectionNumber = btn.dataset.section;
        sectionNumberSpan.textContent = sectionNumber;

        clearList();
        getLawsList(sections, sectionNumber);
    });
}

const sectionNumberSpan = document.querySelector('.section-number');
const lawList = document.querySelector(".law-list");

function getLawsList(sections, sectionNumber) {
    sections[sectionNumber].forEach(element => {
        let lawArticle = document.createElement('div');
        lawArticle.className = "law-article";

        lawArticle.innerHTML = `
            <h4>${element.title}</h4>
            <p>${element.text}</p>
        `;

        lawList.appendChild(lawArticle);
    });
}

function clearList() {
    lawList.innerHTML = "";
}

////// DATA /////
const sections = {
    1: [
    {
        title: "Стаття 1",
        text: `МДПЛ є незалежна, соціальна, правова та демократична держава.`,
    },
    {
        title: "Стаття 2",
        text: `Незалежність МДПЛ розповсюджується на всю її територію.`,
    },
    {
        title: "Стаття 3",
        text: `МДПЛ є республікою, змішаного, президенто-парламентського типу.`,
    },
    {
        title: "Стаття 4",
        text: `В МДПЛ існує єдине громадянство, яке регулюється їхніми правами.`,
    },
    {
        title: "Стаття 5",
        text: `Всі послуги та обов'язки республіки належать на чесності держави.`,
    },
    ],
    2: [
    {
        title: "Стаття 6",
        text: `Усі люди є вільні і рівні у своїй гідності та правах. Права і свободи 
                людини є невідчужуваними та непорушними.`,
    },
    {
        title: "Стаття 7",
        text: `Права і свободи людини і громадянина, закріплені цією 
                Конституцією, не є вичерпними.
                Конституційні права і свободи гарантуються і не можуть бути скасовані.
                При прийнятті нових законів або внесенні змін до чинних законів не 
                допускається звуження змісту та обсягу існуючих прав і свобод.`,
    },
    {
        title: "Стаття 8",
        text: `Громадяни МДПЛ мають рівні конституційні права і свободи та є 
                рівними перед законом.
                Не може бути привілеїв чи обмежень за ознаками раси, кольору шкіри, 
                політичних, релігійних та інших переконань, статі, етнічного та соціального 
                походження, майнового стану, місця проживання, за мовними або іншими 
                ознаками.
                Рівність прав жінки і чоловіка забезпечується: наданням жінкам рівних з 
                чоловіками можливостей у громадсько-політичній і культурній діяльності, у 
                здобутті освіти і професійній підготовці, у праці та винагороді за неї;
                спеціальними заходами щодо охорони праці і здоров'я жінок, 
                встановленням пенсійних пільг; створенням умов, які дають жінкам 
                можливість поєднувати працю з материнством; правовим захистом,
                матеріальною і моральною підтримкою материнства і дитинства, включаючи 
                надання оплачуваних відпусток та інших пільг вагітним жінкам і матерям.`,
    },
    {
        title: "Стаття 9",
        text: ` Кожна людина має невід'ємне право на життя.
                Ніхто не може бути свавільно позбавлений життя. Обов'язок держави - 
                захищати життя людини.
                Кожен має право захищати своє життя і здоров'я, життя і здоров'я інших 
                людей від протиправних посягань.`,
    },
    {
        title: "Стаття 10",
        text: ` Кожен має право на повагу до його гідності.
                Ніхто не може бути підданий катуванню, жорстокому, нелюдському або 
                такому, що принижує його гідність, поводженню чи покаранню.
                Жодна людина без її вільної згоди не може бути піддана медичним, 
                науковим чи іншим дослідам.`,
    },
    ],
    3: [
    {
        title: "Стаття 11",
        text: ` Президент МДПЛ є главою самої держави і виступає від його іменні.`,
    },
    {
        title: "Стаття 12",
        text: ` Президент є гарантом державної незалежності, територіальної 
                цінності, Конституції МДПЛ, прав і свободи громадянина.`,
    },
    {
        title: "Стаття 13",
        text: `Президент обирає громадян для своєї держави.`,
    },
    {
        title: "Стаття 14",
        text: ` Президент керує та надає послуги своїм громадянам, тільки за 
                певними обставинами, що керуються законом.`,
    },
    {
        title: "Стаття 15",
        text: `Президент МДПЛ вибирає та керує виконавчими органами, які 
            пропонуються громадянами держави.`,
    },
    ],
    4: [],
    5: [],
    6: [],
};